
#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author   : pingcuo
# Blog     : 
# Date     : 2019-09-03
# Name     : data
# Software : vscode
# Note     : 

'备用数据'

## 文字部分  *************************************************************************
# 30个字母
words = ['ཀ', 'ཁ', 'ག', 'ང', 'ཅ', 'ཆ', 'ཇ', 'ཉ', 'ཏ', 'ཐ', 'ད', 'ན', 
            'པ', 'ཕ', 'བ', 'མ', 'ཙ', 'ཚ', 'ཛ', 'ཝ', 'ཞ', 'ཟ', 'འ', 'ཡ',
             'ར', 'ལ', 'ཤ', 'ས', 'ཧ', 'ཨ']

sub_word = {'ཀ': 'ྐ',  'ཁ': 'ྑ',  'ག': 'ྒ',  'ང': 'ྔ',  'ཅ': 'ྕ',  'ཆ': 'ྖ',  'ཇ': 'ྗ',  'ཉ': 'ྙ', 
            'ཏ': 'ྟ',  'ཐ': 'ྠ',  'ད': 'ྡ',  'ན': 'ྣ',  'པ': 'ྤ',  'ཕ': 'ྥ',  'བ': 'ྦ',  'མ': 'ྨ', 
            'ཙ': 'ྩ',  'ཚ': 'ྪ',  'ཛ': 'ྫ',  'ཝ': 'ྭ',  'ཞ': 'ྮ',  'ཟ': 'ྯ',  'འ': 'ྰ',  'ཡ': 'ྱ',
             'ར': 'ྲ', 'ལ': 'ླ',  'ཤ': 'ྴ',  'ས': 'ྶ',  'ཧ': 'ྷ',  'ཨ': 'ྸ'}
# 音标
symbol = ['ི',  'ུ',  'ེ' , 'ོ',  'ཽ',  'ྀ',  'ཻ',   '྄',  '༷',  '༵']

# 上加字
top_ra = ['ཀ', 'ག', 'ང', 'ཇ', 'ཉ', 'ཏ', 'ད', 'ན', 'བ', 'མ', 'ཙ', 'ཛ']
top_la = ['ཀ', 'ག', 'ང', 'ཇ', 'ཅ', 'ཏ', 'ད', 'པ', 'བ', 'ཧ' ]
top_sa = ['ཀ', 'ག', 'ང', 'ཉ', 'ཏ', 'ད', 'ན', 'པ', 'བ', 'མ', 'ཙ']
top_ha = ['ཕ']
   
#下加字
under_ya = ['ཀ', 'ཁ', 'ག', 'པ', 'ཕ' ,'པ' ,'མ']
under_ra = ['ཀ', 'ཁ', 'ག', 'ཏ', 'ད', 'པ', 'ཕ', 'བ', 'མ', 'ཤ', 'ས', 'ཧ']
under_la = ['ཀ', 'ག', 'བ', 'ཟ', 'ར', 'ས']
under_wa = ['ཀ', 'ཁ', 'ག', 'ཉ', 'ད', 'ཙ', 'ཚ', 'ཞ', 'ཟ', 'ར' ,'ལ', 'ཤ', 'ས', 'ཧ']

# 同时存在 上加字 下加字
exist_top_under_words = ['ཀ', 'ག', 'ཏ', 'ད', 'པ', 'ཕ', 'བ', 'མ', 'ཧ']
sub_under_word = {'ཀ':[ 'ྐྱ',  'ྐྲ',  'ྐླ',  'ྐྭ'],  'ག':[ 'ྒྱ',  'ྒྲ',  'ྒླ',   'ྒྭ'],  'ཏ':[ 'ྟྲ'],  'ད':[ 'ྡྲ',  'ྡྭ'], 
                  'པ':[ 'ྤྱ',  'ྤྲ'],  'ཕ':[ 'ྥྱ',  'ྥྲ'],  'བ':[ 'ྦྲ',  'ྦླ'],  'མ':[ 'ྨྱ',  'ྨྲ'],  'ཧ':[ 'ྷྲ',  'ྷྭ']}

# 普适的 下加字 和 符号
add_under = ['ྱ'  ,'ྲ'  ,'ླ',  'ྭ',  'ྰ',    '࿆',  '༘',  '༙',  'ྼ',  'ྻ']

# 普适的 后加字 和 符号
add_behind = [ 'ཾ',   'ྃ',   'ཿ',  '༔'] 

# 特殊字
special_words = ['ཛྙ',  'ཧྥ']

# 镜像字    
mirror_key = ['ཀ', 'ཏ', 'ཐ', 'ད', 'ན', 'ཤ']
mirror_value = {'ཀ':'ཀྵ',  'ཏ':'ཊ',  'ཐ':'ཋ',  'ད':'ཌ',  'ན':'ཎ',  'ཤ':'ཥ'}


# སཾསྐྲྀཏ་ (somedreed)四 字
somedreed_word = ['གྷ',  'དྷ',  'ཛྷ', 'བྷ']

#  སཾསྐྲྀཏ་(somedreed) 七音标  只用于 somedreed字
symbol_of_somedreed_phonetic = ['ཱི',  'ཱྀ',  'ཱུ',  'ྲྀ',  'ཷ',  'ླྀ',  'ཹ']

# 镜像字作为下加字  用于 སཾསྐྲྀཏ་ (somedreed)的扩充
mirror_value_as_under_of_somedreed_word = {'ཀ': 'ྐྵ',   'ཏ': 'ྚ',  'ཐ': 'ྛ',  'ད': 'ྜ',  'ན': 'ྞ',  'ཤ': 'ྵ'}



## 可单独成立出现的符号 *****************************************************************
# 数字
numbers = ['༡', '༢', '༣', '༤', '༥', '༦', '༧', '༨', '༩', '༠',
          '༪', '༫', '༬', '༭', '༮', '༯', '༰', '༱', '༲', '༳']

# 句标
single_symbol = ['༌',  '༄',  '༅',  '༑',  '༈',  '།',  '༎',  '༂',  '༃',  '༆', '༇',  '༁',  '྅',  'ༀ']

# 标点符号
punctuation = ['༺',  '༻',  '༼',  '༽']

# སཾསྐྲྀཏ་ (somedreed)四 字标
symbol_of_somedreed_word = ['ྈ',  'ྉ',  'ྊ',  'ྋ']

# སཾསྐྲྀཏ་ (somedreed) 符号 单独成立
symbol_of_somedreed = ['༉',  '༊',  '༏',  '༐',  '༒',  '༓',  '༔',  'ྃ',  '༝',  '྿',  '༶']

# 天文学中的符号  单独成立
symbol_of_calendar = ['༕',  '༖',  '༗',  '༘',  '༙',  '༚',  '༛',  '༜',  '༝',  '༞',  '༟',  '࿏',  '༿',  '༾']

#  藏文中的 音符  单独成立
symbol_of_sound = ['࿀',  '࿁',  '࿂',  '࿃']

# 经文常见符号 单独成立
symbol_of_buddhist_scriptures = ['࿄',  '࿅',  '࿆',  '࿇',  '࿈',  '࿉',  '࿋',  '࿋',  '࿌']