
#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author   : pingcuo
# Blog     : 
# Date     : 2019-09-03
# Name     : data
# Software : vscode
# Note     : 

'备用数据'

# 30个字母
words = ['ཀ', 'ཁ', 'ག', 'ང', 'ཅ', 'ཆ', 'ཇ', 'ཉ', 'ཏ', 'ཐ', 'ད', 'ན', 
            'པ', 'ཕ', 'བ', 'མ', 'ཙ', 'ཚ', 'ཛ', 'ཝ', 'ཞ', 'ཟ', 'འ', 'ཡ',
             'ར', 'ལ', 'ཤ', 'ས', 'ཧ', 'ཨ']
# 30个字母被加 上加字时 的对应 字符映射
sub_word = {'ཀ': 'ྐ',  'ཁ': 'ྑ',  'ག': 'ྒ',  'ང': 'ྔ',  'ཅ': 'ྕ',  'ཆ': 'ྖ',  'ཇ': 'ྗ',  'ཉ': 'ྙ', 
            'ཏ': 'ྟ',  'ཐ': 'ྠ',  'ད': 'ྡ',  'ན': 'ྣ',  'པ': 'ྤ',  'ཕ': 'ྥ',  'བ': 'ྦ',  'མ': 'ྨ', 
            'ཙ': 'ྩ',  'ཚ': 'ྪ',  'ཛ': 'ྫ',  'ཝ': 'ྭ',  'ཞ': 'ྮ',  'ཟ': 'ྯ',  'འ': 'ྰ',  'ཡ': 'ྱ',
             'ར': 'ྲ', 'ལ': 'ླ',  'ཤ': 'ྴ',  'ས': 'ྶ',  'ཧ': 'ྷ',  'ཨ': 'ྸ'}
# 音标
symbol = ['ི',  'ུ',  'ེ' , 'ོ']

# 上加字
top_ra = ['ཀ', 'ག', 'ང', 'ཇ', 'ཉ', 'ཏ', 'ད', 'ན', 'བ', 'མ', 'ཙ', 'ཛ']
top_la = ['ཀ', 'ག', 'ང', 'ཇ', 'ཅ', 'ཏ', 'ད', 'པ', 'བ', 'ཧ' ]
top_sa = ['ཀ', 'ག', 'ང', 'ཉ', 'ཏ', 'ད', 'ན', 'པ', 'བ', 'མ', 'ཙ']
top_ha = ['ཕ']
   
#下加字
under_ya = ['ཀ', 'ཁ', 'ག', 'པ', 'ཕ' ,'པ' ,'མ']
under_ra = ['ཀ', 'ཁ', 'ག', 'ཏ', 'ད', 'པ', 'ཕ', 'བ', 'མ', 'ཤ', 'ས', 'ཧ']
under_la = ['ཀ', 'ག', 'བ', 'ཟ', 'ར', 'ས']
under_wa = ['ཀ', 'ཁ', 'ག', 'ཉ', 'ད', 'ཙ', 'ཚ', 'ཞ', 'ཟ', 'ར' ,'ལ', 'ཤ', 'ས', 'ཧ']

# 同时存在 上加字 下加字
exist_top_under_words = ['ཀ', 'ག', 'ཏ', 'ད', 'པ', 'ཕ', 'བ', 'མ', 'ཧ']
sub_under_word = {'ཀ':[ 'ྐྱ',  'ྐྲ',  'ྐླ',  'ྐྭ'],  'ག':[ 'ྒྱ',  'ྒྲ',  'ྒླ',   'ྒྭ'],  'ཏ':[ 'ྟྲ'],  'ད':[ 'ྡྲ',  'ྡྭ'], 
                  'པ':[ 'ྤྱ',  'ྤྲ'],  'ཕ':[ 'ྥྱ',  'ྥྲ'],  'བ':[ 'ྦྲ',  'ྦླ'],  'མ':[ 'ྨྱ',  'ྨྲ'],  'ཧ':[ 'ྷྲ',  'ྷྭ']}

# 特殊字
under_ha = ['ག', 'ད', 'བ']
under_ny = ['ཛ']
under_va = ['ཨ']

# 镜像字    
mirror_key = ['ཀ', 'ཏ', 'ཐ', 'ད', 'ན', 'ཤ']
mirror_value = {'ཀ':'ཀྵ',  'ཏ':'ཊ',  'ཐ':'ཋ',  'ད':'ཌ',  'ན':'ཎ',  'ཤ':'ཥ'}
